stm32duino/Arduino_Core_STM32/system/Drivers/STM32WL3x_HAL_Driver/Src/stm32wl3x_hal_mrsubg.c
/**
  ******************************************************************************
  * @file    stm32wl3x_hal_mrsubg.c
  * @author  GPM Application Team
  * @brief   This file provides firmware functions to manage the MRSubG
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2024-2025 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */

/* Includes ------------------------------------------------------------------*/
#include "stm32wl3x_hal.h"
#include <string.h>

/** @addtogroup STM32WL3x_HAL_Driver
  * @{
  */

/** @addtogroup MRSUBG
  * @{
  */

#ifdef HAL_MRSUBG_MODULE_ENABLED

/** @defgroup MRSUBG_Private_Constants MRSUBG Private Constants
  * @{
  */
#define MAX_DBM       0x51

/**
  * @}
  */


/** @defgroup MRSUBG_Private_Macros MRSUBG Private Macros
  * @{
  */


#define S_ABS(a) ((a)>0?(a):-(a))

#if defined(STM32WL3RX)
#define IS_FREQUENCY_BAND_LOW_LOW(FREQUENCY) ((FREQUENCY) >= LOW_LOW_BAND_LOWER_LIMIT && \
                                              (FREQUENCY) <= LOW_LOW_BAND_UPPER_LIMIT)
#define IS_FREQUENCY_BAND(FREQUENCY) (IS_FREQUENCY_BAND_HIGH(FREQUENCY) || \
                                      IS_FREQUENCY_BAND_LOW(FREQUENCY)  || \
                                      IS_FREQUENCY_BAND_LOW_LOW(FREQUENCY))
#else
#define IS_FREQUENCY_BAND(FREQUENCY) (IS_FREQUENCY_BAND_HIGH(FREQUENCY) || \
                                      IS_FREQUENCY_BAND_LOW(FREQUENCY))
#endif /* STM32WL3RX */

#define IS_FREQUENCY_BAND_HIGH(FREQUENCY) ((FREQUENCY)>=HIGH_BAND_LOWER_LIMIT && \
                                           (FREQUENCY)<=HIGH_BAND_UPPER_LIMIT)
#define IS_FREQUENCY_BAND_LOW(FREQUENCY) ((FREQUENCY)>=LOW_BAND_LOWER_LIMIT && \
                                          (FREQUENCY)<=LOW_BAND_UPPER_LIMIT)

#define IS_MODULATION(MOD) (((MOD) == MOD_2FSK) || \
                            ((MOD) == MOD_4FSK) || \
                            ((MOD) == MOD_2GFSK05) || \
                            ((MOD) == MOD_2GFSK1)  || \
                            ((MOD) == MOD_4GFSK05) || \
                            ((MOD) == MOD_4GFSK1) || \
                            ((MOD) == MOD_ASK) || \
                            ((MOD) == MOD_OOK) || \
                            ((MOD) == MOD_POLAR) || \
                            ((MOD) == MOD_CW) )


#define IS_DATARATE(DATARATE)      (DATARATE>=MINIMUM_DATARATE && DATARATE<=((uint64_t)MAXIMUM_DATARATE))
#define IS_PAMODEDBM(PAMODE) ((PAMODE == PA_LEGACY) || (PAMODE == PA_FIR))
/**
  * @}
  */

/** @defgroup MRSUBG_Private_Variables MRSUBG Private Variables
  * @{
  */

static const uint32_t s_Channel_Filter_Bandwidth[99] =
{
  1600000, 1510000, 1422000, 1332000, 1244000, 1154000, 1066000, \
  976000, 888000, 800000, 755000, 711000, 666000, 622000, 577000, \
  533000, 488000, 444000, 400000, 377000, 355000, 333000, 311000, \
  288000, 266000, 244000, 222000, 200000, 188000, 178000, 166000, \
  155000, 144000, 133000, 122000, 111000, 100000, 94400, 88900, 83300, \
  77800, 72200, 66700, 61100, 55600, 50000, 47200, 44400, 41600, 38900, \
  36100, 33300, 30500, 27800, 25000, 23600, 22200, 20800, 19400, 18100, \
  16600, 15300, 13900, 12500, 11800, 11100, 10400, 9700, 9000, 8300, 7600, \
  6900, 6125, 5910, 5550, 5200, 4870, 4500, 4100, 3800, 3500, 3125, 2940, \
  2780, 2600, 2400, 2200, 2100, 1900, 1700
};

const uint32_t SFD_2FSK[] =
{
  0x904E0000, /* "1001000001001110" */
  0x6F4E0000  /* "0110111101001110" */
};

const uint32_t SFD_4FSK[] =
{
  0xD75575FD,  /* "11010111010101010111010111111101" */
  0x7DFF75FD   /* "01111101111111110111010111111101" */
};

static WMbusSubmode s_cWMbusSubmode = WMBUS_SUBMODE_NOT_CONFIGURED;

/**
  * @}
  */

/** @defgroup MRSUBG_Private_Functions MRSUBG Private Functions
  * @{
  */

static uint32_t MRSubG_ComputeDatarate(uint16_t cM, uint8_t cE);
static void MRSubG_SearchDatarateME(uint32_t lDatarate, uint16_t *pcM, uint8_t *pcE);
static void MRSubG_SearchFreqDevME(uint32_t lFDev, uint8_t *pcM, uint8_t *pcE, uint8_t bs);
static uint32_t MRSubG_ComputeFreqDeviation(uint8_t cM, uint8_t cE, uint8_t bs);
static void MRSubG_SearchChannelBwME(uint32_t lBandwidth, uint8_t *pcM, uint8_t *pcE);
static void MRSubG_ComputeSynthWord(uint32_t frequency, uint8_t *synth_int, uint32_t *synth_frac, uint8_t *band);
static int32_t MRSubG_ConvertRssiToDbm(uint16_t rssi_level_from_register);
static uint8_t MRSubG_GetAllowedMaxOutputPower(MRSubG_PA_DRVMode paMode);
static void MRSUBG_EvaluateDSSS(MRSubGModSelect xModulation, uint8_t dsssExponent);

/**
  * @brief  Computes the synth word from a given frequency.
  * @param  frequency Target frequency value expressed in Hz.
  * @param  synth_int pointer to the int part of the synth word
  * @param  synth_frac pointer to the fract part of the synth word
  * @param  band pointer to the high/low band selector
  * @retval None.
  */
static void MRSubG_ComputeSynthWord(uint32_t frequency, uint8_t *synth_int, uint32_t *synth_frac, uint8_t *band)
{
  if (IS_FREQUENCY_BAND_HIGH(frequency))
  {
    *band = HIGH_BAND_FACTOR;
  }
#if defined(STM32WL3RX)
  else if (IS_FREQUENCY_BAND_LOW_LOW(frequency))
  {
    *band = LOW_LOW_BAND_FACTOR;
  }
#endif /* STM32WL3RX */
  else
  {
    *band = LOW_BAND_FACTOR;
  }

  *synth_int = (uint32_t)(*band * frequency / LL_GetXTALFreq());

  *synth_frac = (uint32_t)(((*band * (uint64_t)frequency * (1 << 20)) / LL_GetXTALFreq()) - (*synth_int * (1 << 20)));
}

/**
  * @brief  Evaluate the data rate.
  * @param  cM the mantissa value.
  * @param  cE the exponent value.
  * @retval The datarate.
  */
static uint32_t MRSubG_ComputeDatarate(uint16_t cM, uint8_t cE)
{
  uint32_t f_sys = LL_GetXTALFreq() / 3; /* 16 MHz nominal */
  uint64_t dr;

  if (cE == 0)
  {
    dr = ((uint64_t)f_sys * cM);
    return (uint32_t)(dr >> 32);
  }
  else if (cE == 15)
  {
    return ((uint64_t)f_sys * (8 * cM));
  }
  else
  {
    dr = ((uint64_t)f_sys) * ((uint64_t)cM + 65536);
    return (uint32_t)(dr >> (33 - cE));
  }
}

static void MRSubG_SearchDatarateME(uint32_t lDatarate, uint16_t *pcM, uint8_t *pcE)
{
  uint32_t lDatarateTmp;
  uint32_t f_sys = LL_GetXTALFreq() / 3;
  uint8_t uDrE;
  uint64_t tgt1;
  uint64_t tgt2;
  uint64_t tgt;

