stm32duino/Arduino_Core_STM32/system/Drivers/STM32WL3x_HAL_Driver/Src/stm32wl3x_hal_mrsubg.c
  /* Search the exponent value */
  for (uDrE = 0; uDrE < 16; uDrE++)
  {
    lDatarateTmp = MRSubG_ComputeDatarate(0xFFFF, uDrE);
    if (lDatarate <= lDatarateTmp)
    {
      break;
    }
  }
  (*pcE) = (uint8_t)uDrE;

  if (uDrE == 0)
  {
    tgt = ((uint64_t)lDatarate) << 32;
    (*pcM) = (uint16_t)(tgt / f_sys);
    tgt1 = (uint64_t)f_sys * (*pcM);
    tgt2 = (uint64_t)f_sys * ((*pcM) + 1);
  }
  else
  {
    tgt = ((uint64_t)lDatarate) << (33 - uDrE);
    (*pcM) = (uint16_t)((tgt / f_sys) - 65536);
    tgt1 = (uint64_t)f_sys * ((*pcM) + 65536);
    tgt2 = (uint64_t)f_sys * ((*pcM) + 1 + 65536);
  }

  (*pcM) = ((tgt2 - tgt) < (tgt - tgt1)) ? ((*pcM) + 1) : (*pcM);
}

/**
  * @brief  Returns the mantissa and exponent, whose value used in the Frequency Deviation formula
  *         will give the value closer to the given one.
  * @param  cM the mantissa value.
  * @param  cE the exponent value.
  * @param  bs the band value.
  * @retval The frequency deviation.
  */
static uint32_t MRSubG_ComputeFreqDeviation(uint8_t cM, uint8_t cE, uint8_t bs)
{
  uint32_t f_xo = LL_GetXTALFreq();

  if (cE == 0)
  {
    return (uint32_t)((uint64_t)f_xo * (cM * bs / 8) / (bs * (1 << 19)));
  }

  return (uint32_t)((uint64_t)f_xo * ((256 + cM) * (1 << (cE - 1)) * bs / 8) / (bs * (1 << 19)));;
}

/**
  * @brief  Returns the mantissa and exponent, whose value used in the Frequency Deviation formula
  *         will give the value closer to the given one.
  * @param  lFDev frequency deviation expressed in Hz.
  * @param  pcM pointer to the returned mantissa value.
  * @param  pcE pointer to the returned exponent value.
  * @param  bs the high/low band selector
  * @retval None.
  */
static void MRSubG_SearchFreqDevME(uint32_t lFDev, uint8_t *pcM, uint8_t *pcE, uint8_t bs)
{
  uint8_t uFDevE;
  uint32_t lFDevTmp;
  uint64_t tgt1;
  uint64_t tgt2;
  uint64_t tgt;

  /* Search the exponent of the frequency deviation value */
  for (uFDevE = 0; uFDevE != 12; uFDevE++)
  {
    lFDevTmp = MRSubG_ComputeFreqDeviation(255, uFDevE, bs);
    if (lFDev < lFDevTmp)
    {
      break;
    }
  }
  (*pcE) = (uint8_t)uFDevE;

  if (uFDevE == 0)
  {
    tgt = ((uint64_t)lFDev) << 22;
    (*pcM) = (uint32_t)(tgt / LL_GetXTALFreq());
    tgt1 = (uint64_t)LL_GetXTALFreq() * (*pcM);
    tgt2 = (uint64_t)LL_GetXTALFreq() * ((*pcM) + 1);
  }
  else
  {
    tgt = ((uint64_t)lFDev) << (23 - uFDevE);
    (*pcM) = (uint32_t)(tgt / LL_GetXTALFreq()) - 256;
    tgt1 = (uint64_t)LL_GetXTALFreq() * ((*pcM) + 256);
    tgt2 = (uint64_t)LL_GetXTALFreq() * ((*pcM) + 1 + 256);
  }

  (*pcM) = ((tgt2 - tgt) < (tgt - tgt1)) ? ((*pcM) + 1) : (*pcM);
}

/**
  * @brief  Returns the mantissa and exponent for a given bandwidth.
  *         The API will search the closer value according to a fixed table of channel
  *         bandwidth values (@ref s_Channel_Filter_Bandwidth) returning the corresponding mantissa
  *         and exponent value.
  * @param  lBandwidth bandwidth expressed in Hz. This parameter ranging between 1700 and 1600000.
  * @param  pcM pointer to the returned mantissa value.
  * @param  pcE pointer to the returned exponent value.
  * @retval None.
  */
static void MRSubG_SearchChannelBwME(uint32_t lBandwidth, uint8_t *pcM, uint8_t *pcE)
{
  int8_t i;
  int8_t i_tmp;
  uint32_t f_dig;
  int32_t chfltCalculation[3];
  uint8_t j;
  uint32_t chfltDelta;

  f_dig = LL_GetXTALFreq() / 3;

  /* Search the channel filter bandwidth table index */
  for (i = 0; i < 99 &&
       (lBandwidth < (uint32_t)(((uint64_t)s_Channel_Filter_Bandwidth[i] * f_dig) / 16000000));
       i++)
    ;

  if (i != 0)
  {
    /* Finds the index value with best approximation in i-1, i and i+1 elements */
    i_tmp = i;

    for (j = 0; j < 3; j++)
    {
      if (((i_tmp + j - 1) >= 0) && ((i_tmp + j - 1) <= 98))
      {
        chfltCalculation[j] = (int32_t)lBandwidth -
                              (int32_t)(((uint64_t)s_Channel_Filter_Bandwidth[i_tmp + j - 1] * f_dig) / 16000000);
      }
      else
      {
        chfltCalculation[j] = 0x7FFFFFFF;
      }
    }

    chfltDelta = 0xFFFFFFFF;

    for (j = 0; j < 3; j++)
    {
      if (S_ABS(chfltCalculation[j]) < chfltDelta)
      {
        chfltDelta = S_ABS(chfltCalculation[j]);
        i = i_tmp + j - 1;
      }
    }
  }

  (*pcE) = (uint8_t)(i / 9);
  (*pcM) = (uint8_t)(i % 9);
}

/*
 * @brief Convert RSSI_LEVEL_ON_SYNC to dBm
 * @param rssi_level_from_register the value to convert
 * @retval The converted RSSI level in dBm
*/
static int32_t MRSubG_ConvertRssiToDbm(uint16_t rssi_level_from_register)
{
  return (rssi_level_from_register / 2) - (96 + GAIN_RX_CHAIN);
}

/**
  * @brief  Returns the maximum allowed output power supported by the specific configuration
  * @param  paDrvMode the configuration type.
  * @retval The maximum output power.
  */
static uint8_t MRSubG_GetAllowedMaxOutputPower(MRSubG_PA_DRVMode paDrvMode)
{
  uint8_t retPwr = 20;

  switch (paDrvMode)
  {
    case PA_DRV_TX:
      retPwr = 10;
      break;
    case PA_DRV_TX_HP:
      retPwr = 16;
      break;
    case PA_DRV_TX_TX_HP:
      retPwr = 18; /* Max allowed power without PA_DEGEN_ON */
      break;
  }

  return retPwr;
}

/**
  * @brief  Set the proper DSSS configuration
  * @param  xModulation the modulation type.
  * @param  dsssExponent the DSSS exponent.
  * @retval None.
  */
static void MRSUBG_EvaluateDSSS(MRSubGModSelect xModulation, uint8_t dsssExponent)
{
  /* Disable DSSS for modulations different from 2(G)FSK */
  if (xModulation != MOD_2GFSK05 && xModulation != MOD_2GFSK1)
  {
    dsssExponent = 0;
  }

  uint8_t dsss_en = (dsssExponent > 0);
  uint8_t dsss_sf = (1 << dsssExponent); /* Spread Factor = 2^dssExponent */
  uint8_t dsss_acq_thr = (dsss_sf - 1);

  if (dsssExponent > 3)
  {
    dsss_acq_thr = dsss_sf / 2;
  }

  MODIFY_REG_FIELD(MR_SUBG_GLOB_STATIC->DSSS_CTRL,  MR_SUBG_GLOB_STATIC_DSSS_CTRL_DSSS_EN, dsss_en);
  MODIFY_REG_FIELD(MR_SUBG_GLOB_STATIC->DSSS_CTRL,  MR_SUBG_GLOB_STATIC_DSSS_CTRL_SPREADING_EXP, dsssExponent);
  MODIFY_REG_FIELD(MR_SUBG_GLOB_STATIC->DSSS_CTRL,  MR_SUBG_GLOB_STATIC_DSSS_CTRL_ACQ_THR, dsss_acq_thr);
}

/**
  * @}
  */

/** @defgroup MRSUBG_Exported_Functions MRSUBG Exported Functions
  * @{
  */

/**
  * @brief  Get the IP version of the MRSubG.
  * @retval IP version.
  */
SMRSubGVersion_t HAL_MRSubGGetVersion(void)
{
  SMRSubGVersion_t MRSubGVersion;

  MRSubGVersion.product =  READ_REG_FIELD(MR_SUBG_GLOB_MISC->RFIP_VERSION, MR_SUBG_GLOB_MISC_RFIP_VERSION_PRODUCT);
  MRSubGVersion.version =  READ_REG_FIELD(MR_SUBG_GLOB_MISC->RFIP_VERSION, MR_SUBG_GLOB_MISC_RFIP_VERSION_VERSION);
  MRSubGVersion.revision = READ_REG_FIELD(MR_SUBG_GLOB_MISC->RFIP_VERSION, MR_SUBG_GLOB_MISC_RFIP_VERSION_REVISION);

  return MRSubGVersion;
}
/**
  * @brief  Initializes the MR_SUBG radio interface according to the specified
  *         parameters in the pxSRadioInitStruct.
  * @param  pxSRadioInitStruct pointer to a SMRSubGConfig_t structure that
  *         contains the configuration information for the MR_SUBG radio part of STM32WL3x.
  * @retval Error code: 0=no error, 1=error during calibration of VCO.
  */
uint8_t HAL_MRSubG_Init(SMRSubGConfig_t *pxSRadioInitStruct)
{

