stm32duino/Arduino_Core_STM32/system/Drivers/STM32WL3x_HAL_Driver/Src/stm32wl3x_hal_mrsubg.c
  assert_param(IS_FREQUENCY_BAND(pxSRadioInitStruct->lFrequencyBase));
  assert_param(IS_MODULATION(pxSRadioInitStruct->xModulationSelect));
  assert_param(IS_DATARATE(pxSRadioInitStruct->lDatarate));

  HAL_MRSubG_MspInit();

  /* Setup design values for default registers */
  MODIFY_REG_FIELD(MR_SUBG_RADIO->AFC1_CONFIG, MR_SUBG_RADIO_AFC1_CONFIG_AFC_FAST_PERIOD, 0x00);

  MODIFY_REG_FIELD(MR_SUBG_RADIO->CLKREC_CTRL0, MR_SUBG_RADIO_CLKREC_CTRL0_PSTFLT_LEN, 0x01);
  MODIFY_REG_FIELD(MR_SUBG_RADIO->CLKREC_CTRL0, MR_SUBG_RADIO_CLKREC_CTRL0_CLKREC_P_GAIN_FAST, 0x03);
  MODIFY_REG_FIELD(MR_SUBG_RADIO->CLKREC_CTRL0, MR_SUBG_RADIO_CLKREC_CTRL0_CLKREC_I_GAIN_FAST, 0x08);

  MODIFY_REG_FIELD(MR_SUBG_RADIO->CLKREC_CTRL1, MR_SUBG_RADIO_CLKREC_CTRL1_CLKREC_ALGO_SEL, 0x00);
  MODIFY_REG_FIELD(MR_SUBG_RADIO->CLKREC_CTRL1, MR_SUBG_RADIO_CLKREC_CTRL1_CLKREC_P_GAIN_SLOW, 0x05);
  MODIFY_REG_FIELD(MR_SUBG_RADIO->CLKREC_CTRL1, MR_SUBG_RADIO_CLKREC_CTRL1_CLKREC_I_GAIN_SLOW, 0x0C);

  MODIFY_REG_FIELD(MR_SUBG_GLOB_STATIC->DSSS_CTRL, MR_SUBG_GLOB_STATIC_DSSS_CTRL_ACQ_HITS, 0x03);
  MODIFY_REG_FIELD(MR_SUBG_GLOB_STATIC->DSSS_CTRL, MR_SUBG_GLOB_STATIC_DSSS_CTRL_ACQ_WINDOW, 0x04);

  /* Enable calibration */
  SET_BIT(MR_SUBG_GLOB_DYNAMIC->VCO_CAL_CONFIG, MR_SUBG_GLOB_DYNAMIC_VCO_CAL_CONFIG_VCO_CALIB_REQ);

  /* Avoid AGC glitches */
  WRITE_REG(MR_SUBG_RADIO->RF_FSM7_TIMEOUT, 0x0F);

  /* Set synth registers */
  HAL_MRSubG_SetFrequencyBase(pxSRadioInitStruct->lFrequencyBase);

  /* Configure modulation */
  HAL_MRSubG_SetModulation(pxSRadioInitStruct->xModulationSelect, pxSRadioInitStruct->dsssExp);

  /* Configure datarate */
  HAL_MRSubG_SetDatarate(pxSRadioInitStruct->lDatarate);

  /* Configure frequency deviation */
  HAL_MRSubG_SetFrequencyDev(pxSRadioInitStruct->lFreqDev);

  /* Configure RX channel bandwidth */
  HAL_MRSubG_SetChannelBW(pxSRadioInitStruct->lBandwidth);

  /* Configure Output Power */
  HAL_MRSubG_SetPALeveldBm(7, pxSRadioInitStruct->outputPower, pxSRadioInitStruct->PADrvMode);

  return 0;
}

/**
  * @brief  Get the main radio info for the current configuration.
  * @param  pxSRadioInitStruct pointer to a structure of the type of @ref SMRSubGConfig_t
  * @retval None.
  */
void HAL_MRSubG_GetInfo(SMRSubGConfig_t *pxSRadioInitStruct)
{
  pxSRadioInitStruct->lFrequencyBase = HAL_MRSubG_GetFrequencyBase();
  pxSRadioInitStruct->xModulationSelect = HAL_MRSubG_GetModulation();
  pxSRadioInitStruct->lDatarate = HAL_MRSubG_GetDatarate();
  pxSRadioInitStruct->lFreqDev = HAL_MRSubG_GetFrequencyDev();
  pxSRadioInitStruct->lBandwidth = HAL_MRSubG_GetChannelBW();
  pxSRadioInitStruct->outputPower = HAL_MRSubG_GetPALeveldBm();
  pxSRadioInitStruct->PADrvMode = LL_MRSubG_GetPADriveMode();
}

/**
  * @brief  Set the Synth word and the Band Select register according to desired base carrier frequency.
  * @param  lFBase the base carrier frequency expressed in Hz as unsigned word.
  * @retval None.
  */
void HAL_MRSubG_SetFrequencyBase(uint32_t lFBase)
{
  uint8_t band;
  uint8_t synth_int;
  uint32_t synth_frac;
  uint32_t b_factor;

  assert_param(IS_FREQUENCY_BAND(lFBase));

  MRSubG_ComputeSynthWord(lFBase, &synth_int, &synth_frac, &band);

  MODIFY_REG_FIELD(MR_SUBG_GLOB_DYNAMIC->SYNTH_FREQ, MR_SUBG_GLOB_DYNAMIC_SYNTH_FREQ_SYNTH_INT, synth_int);
  MODIFY_REG_FIELD(MR_SUBG_GLOB_DYNAMIC->SYNTH_FREQ, MR_SUBG_GLOB_DYNAMIC_SYNTH_FREQ_SYNTH_FRAC, synth_frac);
  MODIFY_REG_FIELD(MR_SUBG_GLOB_DYNAMIC->ADDITIONAL_CTRL, MR_SUBG_GLOB_DYNAMIC_ADDITIONAL_CTRL_CH_NUM, 0x00);

#if defined(STM32WL33XA)
  b_factor = (20 - band) / 12;
#elif defined(STM32WL3RX)
  if (band == 12)
  {
    SET_BIT(MR_SUBG_RADIO->RFANA_PLL_IN, MR_SUBG_RADIO_RFANA_PLL_IN_DIV12_SEL);
    b_factor = 1;
  }
  else
  {
    b_factor = (band / 4) - 1;
  }
#else
  b_factor = (band / 4) - 1;
#endif /* STM32WL3RX */

  MODIFY_REG_FIELD(MR_SUBG_GLOB_DYNAMIC->SYNTH_FREQ, MR_SUBG_GLOB_DYNAMIC_SYNTH_FREQ_BS, b_factor);
}

/**
  * @brief  Return the base carrier frequency.
  * @retval uint32_t Base carrier frequency expressed in Hz as unsigned word.
  */
uint32_t HAL_MRSubG_GetFrequencyBase(void)
{
#if defined(STM32WL33XA)
  uint8_t bs = READ_REG_FIELD(MR_SUBG_GLOB_DYNAMIC->SYNTH_FREQ, MR_SUBG_GLOB_DYNAMIC_SYNTH_FREQ_BS);
  bs = bs ? 8 : 20;
#else
  uint8_t bs;
#if defined(STM32WL3RX)
  if (READ_BIT(MR_SUBG_RADIO->RFANA_PLL_IN, MR_SUBG_RADIO_RFANA_PLL_IN_DIV12_SEL))
  {
    bs = 12;
  }
  else
  {
    bs = (READ_REG_FIELD(MR_SUBG_GLOB_DYNAMIC->SYNTH_FREQ, MR_SUBG_GLOB_DYNAMIC_SYNTH_FREQ_BS) + 1) * 4;
  }
#else
  bs = (READ_REG_FIELD(MR_SUBG_GLOB_DYNAMIC->SYNTH_FREQ, MR_SUBG_GLOB_DYNAMIC_SYNTH_FREQ_BS) + 1) * 4;
#endif /* STM32WL3RX */
#endif /* STM32WL33XA */

  uint8_t synth_int = READ_REG_FIELD(MR_SUBG_GLOB_DYNAMIC->SYNTH_FREQ, MR_SUBG_GLOB_DYNAMIC_SYNTH_FREQ_SYNTH_INT);
  uint32_t synth_frac = READ_REG(MR_SUBG_GLOB_DYNAMIC->SYNTH_FREQ) & MR_SUBG_GLOB_DYNAMIC_SYNTH_FREQ_SYNTH_FRAC;
  uint32_t fbase;

  fbase = LL_GetXTALFreq() * ((uint64_t)(synth_int * (1 << 20) + synth_frac)) / (bs * (1 << 20));

  return fbase;
}

/**
  * @brief  Set the datarate.
  * @param  lDatarate datarate expressed in sps.
  * @retval None.
  */
void HAL_MRSubG_SetDatarate(uint32_t lDatarate)
{
  uint8_t dr_e;
  uint16_t dr_m;

  assert_param(IS_DATARATE(lDatarate));

  /* Calculates the datarate mantissa and exponent */
  MRSubG_SearchDatarateME(lDatarate, &dr_m, &dr_e);

  MODIFY_REG_FIELD(MR_SUBG_GLOB_DYNAMIC->MOD0_CONFIG, MR_SUBG_GLOB_DYNAMIC_MOD0_CONFIG_DATARATE_M, dr_m);
  MODIFY_REG_FIELD(MR_SUBG_GLOB_DYNAMIC->MOD0_CONFIG, MR_SUBG_GLOB_DYNAMIC_MOD0_CONFIG_DATARATE_E, dr_e);
}

/**
  * @brief  Return the datarate.
  * @retval uint32_t Datarate expressed in sps.
  */
uint32_t HAL_MRSubG_GetDatarate(void)
{
  uint32_t dr;
  uint32_t datarateM;
  uint32_t datarateE;
  uint32_t f_sys;

  datarateM = READ_REG(MR_SUBG_GLOB_DYNAMIC->MOD0_CONFIG) & MR_SUBG_GLOB_DYNAMIC_MOD0_CONFIG_DATARATE_M;
  datarateE = READ_REG_FIELD(MR_SUBG_GLOB_DYNAMIC->MOD0_CONFIG, MR_SUBG_GLOB_DYNAMIC_MOD0_CONFIG_DATARATE_E);

  f_sys = (uint32_t)(LL_GetXTALFreq() / 3);

  if (datarateE == 0)
  {
    dr = f_sys * (datarateM / ((uint64_t)1 << 32));
  }
  else if (datarateE == 15) /* Jitter free mode */
  {
    dr = f_sys / (8 * datarateM);
  }
  else
    dr = f_sys * (((uint64_t)(1 << 16) + datarateM) * (1 << datarateE) / ((uint64_t)1 << 33));
  return dr;
}

/**
  * @brief  Set the frequency deviation.
  * @param  lFDev frequency deviation expressed in Hz.
  * @retval None.
  */
void HAL_MRSubG_SetFrequencyDev(uint32_t lFDev)
{
  uint8_t uFDevM;
  uint8_t uFDevE;
  uint8_t bs;

