stm32duino/Arduino_Core_STM32/system/Drivers/STM32WL3x_HAL_Driver/Src/stm32wl3x_hal_mrsubg.c
#if defined(STM32WL33XA)
  bs = READ_REG_FIELD(MR_SUBG_GLOB_DYNAMIC->SYNTH_FREQ, MR_SUBG_GLOB_DYNAMIC_SYNTH_FREQ_BS);
  bs = bs ? 8 : 20;
#else
#if defined(STM32WL3RX)
  if (READ_BIT(MR_SUBG_RADIO->RFANA_PLL_IN, MR_SUBG_RADIO_RFANA_PLL_IN_DIV12_SEL)) /* Checking if 315MHz band */
  {
    bs = 12;
  }
  else
  {
    bs = (READ_REG_FIELD(MR_SUBG_GLOB_DYNAMIC->SYNTH_FREQ, MR_SUBG_GLOB_DYNAMIC_SYNTH_FREQ_BS) + 1) * 4;
  }
#else
  bs = (READ_REG_FIELD(MR_SUBG_GLOB_DYNAMIC->SYNTH_FREQ, MR_SUBG_GLOB_DYNAMIC_SYNTH_FREQ_BS) + 1) * 4;
#endif /* STM32WL3RX */
#endif /* STM32WL33XA */

  /* Calculates the frequency deviation mantissa and exponent */
  MRSubG_SearchFreqDevME(lFDev, &uFDevM, &uFDevE, bs);

  MODIFY_REG_FIELD(MR_SUBG_GLOB_DYNAMIC->MOD1_CONFIG, MR_SUBG_GLOB_DYNAMIC_MOD1_CONFIG_FDEV_M, uFDevM);
  MODIFY_REG_FIELD(MR_SUBG_GLOB_DYNAMIC->MOD1_CONFIG, MR_SUBG_GLOB_DYNAMIC_MOD1_CONFIG_FDEV_E, uFDevE);
}

/**
  * @brief  Return the frequency deviation.
  * @retval uint32_t Frequency deviation value expressed in Hz.
  */
uint32_t HAL_MRSubG_GetFrequencyDev(void)
{
  uint8_t fdev_m;
  uint8_t fdev_e;
  uint32_t f_dev;
  uint16_t factor1;
  uint32_t factor2;
  uint8_t bs;

#if defined(STM32WL33XA)
  bs = READ_REG_FIELD(MR_SUBG_GLOB_DYNAMIC->SYNTH_FREQ, MR_SUBG_GLOB_DYNAMIC_SYNTH_FREQ_BS);
  bs = bs ? 8 : 20;
#else
#if defined(STM32WL3RX)
  if (READ_BIT(MR_SUBG_RADIO->RFANA_PLL_IN, MR_SUBG_RADIO_RFANA_PLL_IN_DIV12_SEL)) /* Checking if 315MHz band */
  {
    bs = 12;
  }
  else
  {
    bs = (READ_REG_FIELD(MR_SUBG_GLOB_DYNAMIC->SYNTH_FREQ, MR_SUBG_GLOB_DYNAMIC_SYNTH_FREQ_BS) + 1) * 4;
  }
#else
  bs = (READ_REG_FIELD(MR_SUBG_GLOB_DYNAMIC->SYNTH_FREQ, MR_SUBG_GLOB_DYNAMIC_SYNTH_FREQ_BS) + 1) * 4;
#endif /* STM32WL3RX */
#endif /* STM32WL33XA */

  fdev_m = READ_REG(MR_SUBG_GLOB_DYNAMIC->MOD1_CONFIG) & MR_SUBG_GLOB_DYNAMIC_MOD1_CONFIG_FDEV_M;
  fdev_e = READ_REG_FIELD(MR_SUBG_GLOB_DYNAMIC->MOD1_CONFIG, MR_SUBG_GLOB_DYNAMIC_MOD1_CONFIG_FDEV_E);

  factor1 = fdev_e == 0 ? 0 : 256;
  factor2 = fdev_e == 0 ? 0 : (fdev_e - 1);

  f_dev = (LL_GetXTALFreq() * (uint64_t)((factor1 + fdev_m) * (1 << (factor2)) * bs / 8) / (bs * (1 << 19)));

  return f_dev;
}

/**
  * @brief  Set the channel filter bandwidth.
  * @param  lBandwidth channel filter bandwidth expressed in Hz.
  *         The API will search the most closer value according to a fixed table of channel
  *         bandwidth values (@ref s_Channel_Filter_Bandwidth).
  *         To verify the settled channel bandwidth it is possible to use the HAL_MRSubG_GetChannelBW API.
  * @retval None.
  */
void HAL_MRSubG_SetChannelBW(uint32_t lBandwidth)
{
  uint8_t uBwM = 0;
  uint8_t uBwE = 0;
  uint32_t f_if = 0;
  uint32_t if_offset = 0;
  uint32_t chf_threshold = CHANNEL_FILTER_THRESHOLD;
  uint32_t f_dig = LL_GetXTALFreq() / 3;

  /* Calculates the channel bandwidth mantissa and exponent */
  MRSubG_SearchChannelBwME(lBandwidth, &uBwM, &uBwE);

  MODIFY_REG_FIELD(MR_SUBG_GLOB_DYNAMIC->MOD1_CONFIG, MR_SUBG_GLOB_DYNAMIC_MOD1_CONFIG_CHFLT_M, uBwM);
  MODIFY_REG_FIELD(MR_SUBG_GLOB_DYNAMIC->MOD1_CONFIG, MR_SUBG_GLOB_DYNAMIC_MOD1_CONFIG_CHFLT_E, uBwE);

  /* Set IF to 600 kHz, if channel filter requested is greater than CHF threshold */
  if (lBandwidth > chf_threshold)
  {
    SET_BIT(MR_SUBG_GLOB_STATIC->IF_CTRL, MR_SUBG_GLOB_STATIC_IF_CTRL_IF_MODE);

    /* Define f_if */
    f_if = IF_FREQ_HIGH;
  }
  else
  {
    /* Set antialiasing filter to 684kHz */
    CLEAR_BIT(MR_SUBG_GLOB_STATIC->IF_CTRL, MR_SUBG_GLOB_STATIC_IF_CTRL_IF_MODE);

    /* Define f_if */
    f_if = IF_FREQ_LOW;
  }

  if_offset = (((f_if * 100) * 65536) / f_dig) * 10;

  /* Set IF */
#if defined(STM32WL33XA)
  /* WL33xA */
  MODIFY_REG_FIELD(MR_SUBG_GLOB_STATIC->IF_CTRL, MR_SUBG_GLOB_STATIC_IF_CTRL_IF_OFFSET_ANA, 0);
#elif defined(STM32WL3RX)
  /* Checking if 315MHz band */
  if (READ_BIT(MR_SUBG_RADIO->RFANA_PLL_IN, MR_SUBG_RADIO_RFANA_PLL_IN_DIV12_SEL))
  {
    uint32_t if_offset_ana = if_offset * 3 / 2;
    MODIFY_REG_FIELD(MR_SUBG_GLOB_STATIC->IF_CTRL, MR_SUBG_GLOB_STATIC_IF_CTRL_IF_OFFSET_ANA, if_offset_ana);
  }
  else
  {
    MODIFY_REG_FIELD(MR_SUBG_GLOB_STATIC->IF_CTRL, MR_SUBG_GLOB_STATIC_IF_CTRL_IF_OFFSET_ANA, if_offset);
  }
#else
  MODIFY_REG_FIELD(MR_SUBG_GLOB_STATIC->IF_CTRL, MR_SUBG_GLOB_STATIC_IF_CTRL_IF_OFFSET_ANA, if_offset);
#endif /*STM32WL3RX*/

  MODIFY_REG_FIELD(MR_SUBG_GLOB_STATIC->IF_CTRL, MR_SUBG_GLOB_STATIC_IF_CTRL_IF_OFFSET_DIG, if_offset);
}

/**
  * @brief  Return the channel filter bandwidth.
  * @retval uint32_t Channel filter bandwidth expressed in Hz.
  */
uint32_t HAL_MRSubG_GetChannelBW(void)
{
  uint8_t cm;
  uint8_t ce;
  uint8_t index;
  uint32_t fclk;
  uint32_t correction_factor;

  fclk = LL_GetXTALFreq() / 3;
  correction_factor = fclk / 16000000;

  cm = READ_REG_FIELD(MR_SUBG_GLOB_DYNAMIC->MOD1_CONFIG, MR_SUBG_GLOB_DYNAMIC_MOD1_CONFIG_CHFLT_M);
  ce = READ_REG_FIELD(MR_SUBG_GLOB_DYNAMIC->MOD1_CONFIG, MR_SUBG_GLOB_DYNAMIC_MOD1_CONFIG_CHFLT_E);

  index = ce * 9 + cm;

  return correction_factor * s_Channel_Filter_Bandwidth[index];
}

/**
  * @brief  Set the modulation type.
  * @param  xModulation modulation to set.
  *         This parameter shall be of type @ref MRSubGModSelect.
  * @param  dsssExponent the DSSS spreading exponent. 0 means DSSS disabled.
  * @retval None.
  */
void HAL_MRSubG_SetModulation(MRSubGModSelect xModulation, uint8_t dsssExponent)
{
  assert_param(IS_MODULATION(xModulation));

  /* Internal equalizer */
  switch (xModulation)
  {
    case MOD_2GFSK05:
    case MOD_4GFSK05:
    case MOD_2GFSK1:
    case MOD_4GFSK1:
      /*In case of gaussian filter, in order to reduce intersymbol interference (ISI),
      * we have to set the internal equalizer to 2 symbols */
      MODIFY_REG_FIELD(MR_SUBG_GLOB_STATIC->AS_QI_CTRL, MR_SUBG_GLOB_STATIC_AS_QI_CTRL_AS_EQU_CTRL, 0x02);
      break;
    default:
      /* For non gaussian modulation set internal equalizer to 0 symbols */
      MODIFY_REG_FIELD(MR_SUBG_GLOB_STATIC->AS_QI_CTRL, MR_SUBG_GLOB_STATIC_AS_QI_CTRL_AS_EQU_CTRL, 0x00);
  }

  /* Post filter */
  switch (xModulation)
  {
    case MOD_4GFSK05:
    case MOD_4GFSK1:
    case MOD_4FSK:
      /*In case of 4 level FSK modulation, in order to reduce intersymbol interference (ISI),
      * we have to set the post filter len equal to 8 (register value 0). */
      MODIFY_REG_FIELD(MR_SUBG_RADIO->CLKREC_CTRL0, MR_SUBG_RADIO_CLKREC_CTRL0_PSTFLT_LEN, 0x00);
      break;
    default:
      MODIFY_REG_FIELD(MR_SUBG_RADIO->CLKREC_CTRL0, MR_SUBG_RADIO_CLKREC_CTRL0_PSTFLT_LEN, 0x01);
  }

  /* Modulation */
  switch (xModulation)
  {
    case MOD_2GFSK05:
    case MOD_4GFSK05:
      MODIFY_REG_FIELD(MR_SUBG_GLOB_DYNAMIC->MOD0_CONFIG, MR_SUBG_GLOB_DYNAMIC_MOD0_CONFIG_BT_SEL, 1);
      xModulation &= 0x0F;
      break;
    default:
      MODIFY_REG_FIELD(MR_SUBG_GLOB_DYNAMIC->MOD0_CONFIG, MR_SUBG_GLOB_DYNAMIC_MOD0_CONFIG_BT_SEL, 0);
  }

  /* Evaluate DSSS settings */
  MRSUBG_EvaluateDSSS(xModulation, dsssExponent);

  MODIFY_REG_FIELD(MR_SUBG_GLOB_DYNAMIC->MOD0_CONFIG, MR_SUBG_GLOB_DYNAMIC_MOD0_CONFIG_MOD_TYPE, xModulation);
}

/**
  * @brief  Return the modulation type used.
  * @retval MRSubGModSelect Settled modulation type.
  */
MRSubGModSelect HAL_MRSubG_GetModulation(void)
{
  MRSubGModSelect retMod;
  uint8_t bt;

  retMod = (MRSubGModSelect)(
             READ_REG_FIELD(MR_SUBG_GLOB_DYNAMIC->MOD0_CONFIG,
                            MR_SUBG_GLOB_DYNAMIC_MOD0_CONFIG_MOD_TYPE));

  if (retMod == MOD_2GFSK1 || retMod == MOD_4GFSK1)
  {
    /* Check the BT_SEL bit to evaluate if xGFSK1 or 05 */
    bt = READ_REG_FIELD(MR_SUBG_GLOB_DYNAMIC->MOD0_CONFIG, MR_SUBG_GLOB_DYNAMIC_MOD0_CONFIG_BT_SEL);

    if (bt)
    {
      retMod |= 0x10;
    }
  }

  return retMod;
}

/**
  * @brief  Return RSSI value in dBm from content of RSSI_LEVEL_ON_SYNC field.
  * @retval int32_t RSSI value.
  */
int32_t HAL_MRSubG_GetRssidBm(void)
{
  uint16_t rssiReg = LL_MRSubG_GetRssiLevelOnSync();
  return __HAL_MRSUBG_CONVERT_RSSI_TO_DBM(rssiReg);
}

/**
  * @brief  Set the value for RSSI threshold according to the following formula:
  * RSSIdBm = (rssi_level_xx/2)-(96+GAIN_RX_CHAIN) - See equation 7 in UM_MR_SubG_IP
  * @param  rssiTh The desired RSSI threshold in dBm.
  * @retval None.
  */
void HAL_MRSubG_SetRSSIThreshold(int16_t rssiTh)
{
  uint16_t rssiValReg = 2 * (rssiTh + (96 + GAIN_RX_CHAIN));
  LL_MRSubG_SetRssiThresholdRegister(rssiValReg);
}

/**
  * @brief  Get the value for RSSI threshold in dBm
  * @retval int32_t the RSSI Threshold in dBm.
  */
int32_t HAL_MRSubG_GetRSSIThreshold(void)
{
  /* Return RSSI Threshold */
  uint16_t rssiReg = READ_REG(MR_SUBG_GLOB_STATIC->AS_QI_CTRL) & MR_SUBG_GLOB_STATIC_AS_QI_CTRL_RSSI_THR;
  return MRSubG_ConvertRssiToDbm(rssiReg);
}

/**
  * @brief  Sets a specific PA_LEVEL register, with a value given in dBm.
  * @param  cIndex PA_LEVEL to set. This parameter shall be in the range [0:7].
  * @param  lPowerdBm PA value to write expressed in dBm.
  * @param  drvMode PA drive modes.
  * @retval None.
  */
void HAL_MRSubG_SetPALeveldBm(uint8_t cIndex, int8_t lPowerdBm, MRSubG_PA_DRVMode drvMode)
{
  int32_t pa03 = 0;
  int32_t pa07 = 0;
  uint8_t maxAllowedValue;

