stm32duino/Arduino_Core_STM32/system/Drivers/STM32WL3x_HAL_Driver/Src/stm32wl3x_hal_mrsubg.c
  SET_BIT(MR_SUBG_GLOB_STATIC->PA_CONFIG, MR_SUBG_GLOB_STATIC_PA_CONFIG_PA_RAMP_ENABLE);

  LL_MRSubG_SetPAMode(PA_LEGACY);
  LL_MRSubG_SetPADriveMode(drvMode);

  MODIFY_REG_FIELD(MR_SUBG_GLOB_STATIC->PA_CONFIG, MR_SUBG_GLOB_STATIC_PA_CONFIG_PA_LEVEL_MAX_INDEX, cIndex);

  maxAllowedValue = MRSubG_GetAllowedMaxOutputPower(drvMode);

  if (lPowerdBm > maxAllowedValue)
  {
    lPowerdBm = MAX_DBM;
    LL_MRSubG_SetPADegen(ENABLE);
  }
  else
  {
    int8_t tmpPow;
    tmpPow = MAX_DBM - ((maxAllowedValue - lPowerdBm) * 2);

    lPowerdBm = tmpPow > 0 ? tmpPow : 0;
  }

  for (int16_t i = cIndex; i >= 0; i--)
  {
    if (i < 4)
    {
      pa03 |= (int32_t)(lPowerdBm) << (i * 8);
    }
    else
      pa07 |= (int32_t)lPowerdBm
              << ((i % 4) * 8);
    lPowerdBm = (lPowerdBm - 10) > 0 ? lPowerdBm - 10 : 0;
  }

  WRITE_REG(MR_SUBG_GLOB_STATIC->PA_LEVEL_3_0, pa03);
  WRITE_REG(MR_SUBG_GLOB_STATIC->PA_LEVEL_7_4, pa07);
}

/**
  * @brief  Returns the current output power level of the Power Amplifier (PA).
  *
  * This function reads the power level from the hardware register and returns:
  *   - The value expressed in dBm only if the PA mode is set to LEGACY or FIR mode.
  *
  * @note   The conversion to dBm is performed exclusively when the PA mode is LEGACY or FIR.
  *
  * @retval int8_t
  *         - Output power level expressed in dBm
  */
int8_t HAL_MRSubG_GetPALeveldBm(void)
{
  uint8_t maxIdx = LL_MRSubG_GetPALevelMaxIndex();
  uint32_t regValue;
  uint8_t paLevel;
  MRSubG_PAMode paMode;
  uint8_t maxAllowedValue;
  int16_t paOutputDbm;

  paMode = LL_MRSubG_GetPAMode();
  assert_param(IS_PAMODEDBM(paMode));

  maxAllowedValue = MRSubG_GetAllowedMaxOutputPower(LL_MRSubG_GetPADriveMode());

  if (paMode == PA_LEGACY)
  {
    if (maxIdx < 4)
    {
      regValue = READ_REG(MR_SUBG_GLOB_STATIC->PA_LEVEL_3_0);
      paLevel = (uint8_t)((regValue >> (maxIdx * 8)) & 0xFF);
    }
    else
    {
      regValue = READ_REG(MR_SUBG_GLOB_STATIC->PA_LEVEL_7_4);
      paLevel = (uint8_t)((regValue >> ((maxIdx % 4) * 8)) & 0XFF);
    }
  }
  else
  {
    paLevel = READ_REG_FIELD(MR_SUBG_GLOB_STATIC->PA_LEVEL_7_4, MR_SUBG_GLOB_STATIC_PA_LEVEL_7_4_PA_LEVEL7);
  }
  paOutputDbm = maxAllowedValue - ((MAX_DBM - paLevel) >> 1);
  return (int8_t)paOutputDbm;
}

/**
  * @brief  Returns the number of bytes after each TX/RX transaction.
  * @retval The number of bytes after each TX/RX transaction.
  */
uint32_t HAL_MRSubG_GetBytesOfTransaction(void)
{
  uint16_t used = READ_REG_FIELD(
                    MR_SUBG_GLOB_STATUS->DATABUFFER_INFO,
                    MR_SUBG_GLOB_STATUS_DATABUFFER_INFO_NB_DATABUFFER_USED
                  );

  uint16_t size = READ_REG(MR_SUBG_GLOB_STATIC->DATABUFFER_SIZE) &
                  MR_SUBG_GLOB_STATIC_DATABUFFER_SIZE_DATABUFFER_SIZE;

  uint16_t count = READ_REG_FIELD(
                     MR_SUBG_GLOB_STATUS->DATABUFFER_INFO,
                     MR_SUBG_GLOB_STATUS_DATABUFFER_INFO_CURRENT_DATABUFFER_COUNT
                   );

  return (used * size) + count;
}

/*
 * @brief  Convert microseconds into interpolated absolute time value. SCM_COUNTER must be ready for meaningful results.
 * @param  microseconds Time in microseconds (integer)
 * @retval Time in interpolated absolute time units, can be used for sequencer intervals and timeouts.
 */
uint32_t HAL_MRSubG_Sequencer_Microseconds(uint32_t microseconds)
{
  /* Determine true frequency (relative to 16MHz clock) of "interpolated absolute time" value */
  uint16_t slow_clock_freq = SLOW_CLOCK_FREQ_DEFAULT;

  uint16_t scm_counter_currval = READ_REG_FIELD(
                                   MR_SUBG_GLOB_MISC->SCM_COUNTER_VAL,
                                   MR_SUBG_GLOB_MISC_SCM_COUNTER_VAL_SCM_COUNTER_CURRVAL
                                 );

  if (scm_counter_currval != 0)
  {
    slow_clock_freq = 32ull * 16000000ull / scm_counter_currval;
  }

  uint64_t interpolated_absolute_time = 16u * slow_clock_freq;

  return (((uint64_t)microseconds) * interpolated_absolute_time / 1000000ull) + 0x20;
}

/*
 * @brief  Convert milliseconds into interpolated absolute time value. SCM_COUNTER must be ready for meaningful results.
 * @param  milliseconds Time in milliseconds (integer)
 * @retval Time in interpolated absolute time units, can be used for sequencer intervals and timeouts.
 */
uint32_t HAL_MRSubG_Sequencer_Milliseconds(uint32_t milliseconds)
{
  return HAL_MRSubG_Sequencer_Microseconds(milliseconds * 1000ul);
}

/*
 * @brief  Convert seconds into interpolated absolute time value. SCM_COUNTER must be ready for meaningful results.
 * @param  seconds Time in seconds (integer)
 * @retval Time in interpolated absolute time units, can be used for sequencer intervals and timeouts.
 */
uint32_t HAL_MRSubG_Sequencer_Seconds(uint32_t seconds)
{
  return HAL_MRSubG_Sequencer_Microseconds(seconds * 1000000ul);
}

/*
 * @brief  Store the current contents of all static SubGHz static configuration registers to
 *         given global configuration table for sequencer.
 * @param  cfg Pointer to global configuration table struct.
 * @retval SUCCESS if operation was successful, ERROR if RAM table pointer is not word-aligned.
 */
ErrorStatus HAL_MRSubG_Sequencer_ApplyStaticConfig(MRSubG_Sequencer_GlobalConfiguration_t *cfg)
{
  /* Ensure GlobalConfiguration RAM table is word-aligned */
  if (((uint32_t)cfg) % 4 != 0)
  {
    return ERROR;
  }

  memcpy((void *)&cfg->StaticConfigReg, (void *)MR_SUBG_GLOB_STATIC, sizeof(MR_SUBG_GLOB_STATIC_TypeDef));

  return SUCCESS;
}

/*
 * @brief  Store the current contents of all static SubGHz static configuration registers to
 *         given global configuration table for sequencer.
 * @param  cfg Pointer to global configuration table struct.
 * @param  cmd The command (e.g., TX / RX / SABORT) to issue upon execution of this sequencer action.
 * @retval SUCCESS if operation was successful, ERROR if RAM table pointer is not word-aligned
 *         or NextAction1Interval / NextAction2Interval value is invalid.
 */
ErrorStatus HAL_MRSubG_Sequencer_ApplyDynamicConfig(MRSubG_Sequencer_ActionConfiguration_t *cfg, MRSubGCmd cmd)
{
  /* Ensure ActionConfiguration RAM table is word-aligned */
  if (((uint32_t)cfg) % 4 != 0)
  {
    return ERROR;
  }

  /* NextAction1Interval and NextAction2Interval must not be smaller than (SOC_WAKEUP_OFFSET + 2) slow clock cycles */
  uint32_t soc_wakeup_offset = READ_REG_FIELD(
                                 MR_SUBG_GLOB_RETAINED->WAKEUP_CTRL,
                                 MR_SUBG_GLOB_RETAINED_WAKEUP_CTRL_SOC_WAKEUP_OFFSET
                               );
  uint32_t min_next_action_interval = (soc_wakeup_offset + 2) * 16;

  if (cfg->NextAction1Interval != 0 && cfg->NextAction1Interval < min_next_action_interval)
  {
    return ERROR;
  }

  if (cfg->NextAction2Interval != 0 && cfg->NextAction2Interval < min_next_action_interval)
  {
    return ERROR;
  }

  /* Copy current dynamic register configuration to ActionConfiguration block */
  memcpy(
    (void *)&cfg->DynamicConfigReg,
    (void *)MR_SUBG_GLOB_DYNAMIC,
    sizeof(MR_SUBG_GLOB_DYNAMIC_TypeDef)
  );

  MODIFY_REG_FIELD(cfg->DynamicConfigReg.COMMAND, MR_SUBG_GLOB_DYNAMIC_COMMAND_COMMAND_ID, cmd);

  return SUCCESS;
}

/**
  * @brief  Set the payload length for the Basic packet format.
  * @param  nPayloadLength payload length in bytes.
  * @retval None.
  */
void HAL_MRSubG_PktBasicSetPayloadLength(uint16_t nPayloadLength)
{
  MODIFY_REG_FIELD(MR_SUBG_GLOB_STATIC->DATABUFFER_SIZE, MR_SUBG_GLOB_STATIC_DATABUFFER_SIZE_DATABUFFER_SIZE,
                   nPayloadLength);
  LL_MRSUBG_SetPacketLength(nPayloadLength);
}

/**
  * @brief  Initialize the STM32WL3x Basic packet according to the specified parameters
  *         in the MRSubG_PcktBasicFields_t struct.
  * @param  pxPktBasicInit Basic packet init structure.
  *         This parameter is a pointer to @ref MRSubG_PcktBasicFields_t.
  * @retval None.
  */
void HAL_MRSubG_PacketBasicInit(MRSubG_PcktBasicFields_t *pxPktBasicInit)
{

  /* Check the parameters */
  assert_param(IS_PREAMBLE_LEN(pxPktBasicInit->PreambleLength));
  assert_param(IS_SYNC_LEN(pxPktBasicInit->SyncLength));
  assert_param(IS_FUNCTIONAL_STATE(pxPktBasicInit->DataWhitening));

  /* Set the Packet Format to Basic Packet */
  MODIFY_REG_FIELD(MR_SUBG_GLOB_STATIC->PCKT_CTRL, MR_SUBG_GLOB_STATIC_PCKT_CTRL_PCKT_FORMAT, PKT_BASIC);

