stm32duino/Arduino_Core_STM32/system/Drivers/STM32WL3x_HAL_Driver/Src/stm32wl3x_hal_mrsubg.c
  /* Init the Whitening to 0x1FF */
  LL_MRSubG_PacketHandlerSetWhiteningInit(0x1FF);

  /* Set the SYNC */
  LL_MRSubG_SetSyncPresent(pxPktBasicInit->SyncPresent);
  LL_MRSubG_SetSyncLength(pxPktBasicInit->SyncLength);
  LL_MRSubG_SetSyncWord(pxPktBasicInit->SyncWord);
  LL_MRSubG_SetSecondarySync(DISABLE);

  /* Set the PREAMBLE */
  LL_MRSubG_SetPreambleLength(pxPktBasicInit->PreambleLength);
  LL_MRSubG_SetPreambleSeq(pxPktBasicInit->PreambleSequence);

  LL_MRSubG_PacketHandlerWhitening(pxPktBasicInit->DataWhitening);
  LL_MRSubG_PacketHandlerCoding(pxPktBasicInit->Coding);
  LL_MRSubG_PacketHandlerSetCrcMode(pxPktBasicInit->CrcMode);
  MODIFY_REG(MR_SUBG_GLOB_STATIC->CRC_INIT, MR_SUBG_GLOB_STATIC_CRC_INIT_CRC_INIT_VAL, 0xFFFFFFFF);

  /* Set the Fixed or Variable Packet Length mode */
  LL_MRSUBG_SetFixedVariableLength(pxPktBasicInit->FixVarLength);

  /* Set the Packet Length width. Relevant only if FIX_VAR_LEN=1  */
  LL_MRSubG_SetLenWidth(pxPktBasicInit->LengthWidth);

  LL_MRSubG_SetPostambleLength(pxPktBasicInit->PostambleLength);
  LL_MRSubG_SetPostamblSeq(pxPktBasicInit->PostambleSequence);
}

/**
  * @brief  Initialize the STM32WL3x WMBUS packet according to the specified parameters
  *         in the PktWMbusInit struct.
  * @param  pxPktWMbusInit Pointer to a PktWMbusInit structure that contains the configuration
  *         information for the specified S2LP WMBUS PACKET FORMAT.
  *         This parameter is a pointer to @ref MRSubG_WMBUS_PcktFields_t.
  * @retval None.
  */
void HAL_MRSubG_WMBus_PacketInit(MRSubG_WMBUS_PcktFields_t *pxPktWMbusInit)
{
  /* Check the parameters */
  assert_param(IS_WMBUS_SUBMODE(pxPktWMbusInit->xWMbusSubmode));

  /* Set the Packet Format to WMBus Packet and disable HW CRC */
  MODIFY_REG_FIELD(MR_SUBG_GLOB_STATIC->PCKT_CTRL, MR_SUBG_GLOB_STATIC_PCKT_CTRL_PCKT_FORMAT, PKT_BASIC);
  LL_MRSubG_PacketHandlerSetCrcMode(PKT_NO_CRC);

  s_cWMbusSubmode = pxPktWMbusInit->xWMbusSubmode;

  if (s_cWMbusSubmode == WMBUS_SUBMODE_S1_S2_LONG_HEADER)
  {
    LL_MRSubG_SetPreambleLength(((uint16_t)pxPktWMbusInit->PreambleLength) + WMBUS_PREAMBLE_LEN_S1S2LONGHEADER);

    /* Set the SYNC */
    LL_MRSubG_SetSyncPresent(ENABLE);
    LL_MRSubG_SetSyncLength(WMBUS_SYNC_LEN_S1S2LONGHEADER);
    LL_MRSubG_SetSyncWord(WMBUS_SYNCWORD_S1S2LONGHEADER);

    /* Set the Coding type */
    LL_MRSubG_PacketHandlerCoding(CODING_MANCHESTER);
    LL_MRSubG_PacketHandlerManchesterType(MANCHESTER_TYPE1);

    LL_MRSubG_SetPostamblSeq(POST_SEQ_1010);
  }
  else if (s_cWMbusSubmode == WMBUS_SUBMODE_S1_M_S2_T2_OTHER_TO_METER)
  {
    LL_MRSubG_SetPreambleLength(((uint16_t)pxPktWMbusInit->PreambleLength) + WMBUS_PREAMBLE_LEN_S1MS2T2OTHERTOMETER);

    /* Set the SYNC */
    LL_MRSubG_SetSyncPresent(ENABLE);
    LL_MRSubG_SetSyncLength(WMBUS_SYNC_LEN_S1MS2T2OTHERTOMETER);
    LL_MRSubG_SetSyncWord(WMBUS_SYNCWORD_S1MS2T2OTHERTOMETER);

    /* Set the Coding type */
    LL_MRSubG_PacketHandlerCoding(CODING_MANCHESTER);

    /* Constellation map setting */
    LL_MRSubG_SetConstellationMapping((uint8_t)2); /* See Table 42 of the ref. manual */

    LL_MRSubG_SetPostamblSeq(POST_SEQ_1010);
  }
  else if (s_cWMbusSubmode == WMBUS_SUBMODE_T1_T2_METER_TO_OTHER)
  {
    LL_MRSubG_SetPreambleLength(((uint16_t)pxPktWMbusInit->PreambleLength) + WMBUS_PREAMBLE_LEN_T1T2METERTOOTHER);

    /* Set the SYNC */
    LL_MRSubG_SetSyncPresent(ENABLE);
    LL_MRSubG_SetSyncLength(WMBUS_SYNC_LEN_T1T2METERTOOTHER);
    LL_MRSubG_SetSyncWord(WMBUS_SYNCWORD_T1T2METERTOOTHER);

    /* Set the Coding type */
    LL_MRSubG_PacketHandlerCoding(CODING_3o6);
  }
  else if (s_cWMbusSubmode == WMBUS_SUBMODE_R2_SHORT_HEADER)
  {
    LL_MRSubG_SetPreambleLength(((uint16_t)pxPktWMbusInit->PreambleLength) + WMBUS_PREAMBLE_LEN_R2);

    /* Set the SYNC */
    LL_MRSubG_SetSyncPresent(ENABLE);
    LL_MRSubG_SetSyncLength(WMBUS_SYNC_LEN_R2);
    LL_MRSubG_SetSyncWord(WMBUS_SYNCWORD_R2);

    /* Set the Coding type */
    LL_MRSubG_PacketHandlerCoding(CODING_MANCHESTER);

    /* Constellation map setting */
    LL_MRSubG_SetConstellationMapping((uint8_t)2); /* See Table 42 of the ref. manual */
  }

  LL_MRSubG_SetPostambleLength(pxPktWMbusInit->PostambleLength);
}

/**
  * @brief  Initialize the STM32WL3x 802.15.4 packet according to the specified parameters
  *         in the MRSubG_802_15_4_PcktFields_t struct.
  * @param  px802_15_4PktInit 802.15.4 packet init structure.
  *         This parameter is a pointer to @ref MRSubG_802_15_4_PcktFields_t.
  * @retval 1 in case of errors.
  */
void HAL_MRSubG_802_15_4_PacketInit(MRSubG_802_15_4_PcktFields_t *px802_15_4PktInit)
{

  uint32_t const *sync_word_ptr;
  uint8_t sync_word_len;
  uint16_t preamble_len;

  /* Check the parameters */
  assert_param(IS_MODULATION_15_4G(px802_15_4PktInit->Modulation));
  assert_param(IS_FCS_TYPE(px802_15_4PktInit->FCSType));
  assert_param(IS_PREAMBLE_15_4G_LEN(px802_15_4PktInit->PreambleLength));
  assert_param(IS_FEC_TYPE(px802_15_4PktInit->FecType));
  assert_param(IS_FUNCTIONAL_STATE(px802_15_4PktInit->Whitening));
  assert_param(IS_FRAME_LEN(px802_15_4PktInit->FrameLength));

  if (px802_15_4PktInit->Modulation == MOD_2FSK)
  {
    sync_word_ptr = SFD_2FSK;
    sync_word_len = 2;
    preamble_len = px802_15_4PktInit->PreambleLength * 8;
  }
  else
  {
    sync_word_ptr = SFD_4FSK;
    sync_word_len = 4;
    preamble_len = px802_15_4PktInit->PreambleLength * 16;
  }

  /* Init the Whitening to 0x1FF */
  LL_MRSubG_PacketHandlerSetWhiteningInit(0x1FF);

  /* Set the Packet Format to 802.15.4 Packet */
  MODIFY_REG_FIELD(MR_SUBG_GLOB_STATIC->PCKT_CTRL, MR_SUBG_GLOB_STATIC_PCKT_CTRL_PCKT_FORMAT, PKT_802_15_4);

  WRITE_REG(MR_SUBG_GLOB_STATIC->SYNC, sync_word_ptr[0]);

  WRITE_REG(MR_SUBG_GLOB_STATIC->SEC_SYNC, sync_word_ptr[1]);

  MODIFY_REG_FIELD(MR_SUBG_GLOB_STATIC->PCKT_CONFIG, MR_SUBG_GLOB_STATIC_PCKT_CONFIG_PREAMBLE_SEQ, PRE_SEQ_0101);

  MODIFY_REG_FIELD(MR_SUBG_GLOB_STATIC->PCKT_CONFIG, MR_SUBG_GLOB_STATIC_PCKT_CONFIG_PREAMBLE_LENGTH, preamble_len / 2);

