stm32duino/Arduino_Core_STM32/system/Drivers/STM32WL3x_HAL_Driver/Src/stm32wl3x_hal_mrsubg.c
  MODIFY_REG_FIELD(MR_SUBG_GLOB_STATIC->PCKT_CONFIG, MR_SUBG_GLOB_STATIC_PCKT_CONFIG_SYNC_PRESENT, 1);

  MODIFY_REG_FIELD(
    MR_SUBG_GLOB_STATIC->PCKT_CONFIG,
    MR_SUBG_GLOB_STATIC_PCKT_CONFIG_SYNC_LEN,
    SYNC_BYTE(sync_word_len)
  );

  MODIFY_REG_FIELD(MR_SUBG_GLOB_STATIC->PCKT_CONFIG, MR_SUBG_GLOB_STATIC_PCKT_CONFIG_CRC_MODE,
                   px802_15_4PktInit->FCSType);

  MODIFY_REG_FIELD(MR_SUBG_GLOB_DYNAMIC->PCKTLEN_CONFIG, MR_SUBG_GLOB_DYNAMIC_PCKTLEN_CONFIG_PCKTLEN,
                   px802_15_4PktInit->FrameLength);

  MODIFY_REG_FIELD(MR_SUBG_GLOB_STATIC->PCKT_CTRL, MR_SUBG_GLOB_STATIC_PCKT_CTRL_FCS_TYPE_4G,
                   (px802_15_4PktInit->FCSType == FCS_16BIT) ? 1 : 0);

  MODIFY_REG_FIELD(MR_SUBG_GLOB_STATIC->PCKT_CTRL, MR_SUBG_GLOB_STATIC_PCKT_CTRL_FEC_TYPE_4G,
                   (px802_15_4PktInit->FecType > 1 ? 1 : 0));

  MODIFY_REG_FIELD(
    MR_SUBG_GLOB_STATIC->PCKT_CTRL,
    MR_SUBG_GLOB_STATIC_PCKT_CTRL_INT_EN_4G,
    ((px802_15_4PktInit->FecType == FEC_15_4_G_NRNSC) ||
     (px802_15_4PktInit->FecType == FEC_15_4_G_RSC_Interleaving))
  );

  MODIFY_REG_FIELD(MR_SUBG_GLOB_STATIC->PCKT_CTRL, MR_SUBG_GLOB_STATIC_PCKT_CTRL_CODING_SEL,
                   (px802_15_4PktInit->FecType > 0));

  MODIFY_REG_FIELD(MR_SUBG_GLOB_STATIC->PCKT_CTRL, MR_SUBG_GLOB_STATIC_PCKT_CTRL_WHIT_EN, px802_15_4PktInit->Whitening);

  MODIFY_REG_FIELD(MR_SUBG_GLOB_STATIC->PCKT_CTRL, MR_SUBG_GLOB_STATIC_PCKT_CTRL_WHIT_BF_FEC, 0);

  MODIFY_REG_FIELD(MR_SUBG_GLOB_STATIC->PCKT_CTRL, MR_SUBG_GLOB_STATIC_PCKT_CTRL_BYTE_SWAP, 1);

  WRITE_REG(MR_SUBG_GLOB_STATIC->CRC_INIT, ((px802_15_4PktInit->FCSType == FCS_16BIT) ? 0 : 0xFFFFFFFF));
}

/**
  * @brief MRSUBG MSP Init
  * @retval None
  */
__weak void HAL_MRSubG_MspInit(void)
{
  /* NOTE : This function Should not be modified, when the callback is needed,
            the HAL_MRSubG_MspInit could be implemented in the user file
    */
}

/**
  * @brief MRSUBG MSP DeInit
  * @retval None
  */
__weak void HAL_MRSubG_MspDeInit(void)
{

  /* NOTE : This function Should not be modified, when the callback is needed,
            the HAL_MRSubG_MspDeInit could be implemented in the user file
    */
}

__weak void HAL_MRSubG_IRQ_Callback(void)
{
  /* NOTE : This function Should not be modified, when the callback is needed,
             the HAL_MRSubG_IRQ_Callback could be implemented in the user file
    */
}

__weak void HAL_MRSubG_BUSY_Callback(void)
{
  /* NOTE : This function Should not be modified, when the callback is needed,
             the HAL_MRSubG_BUSY_Callback could be implemented in the user file
    */
}

__weak void HAL_MRSubG_TX_RX_SEQUENCE_Callback(void)
{
  /* NOTE : This function Should not be modified, when the callback is needed,
             the HAL_MRSubG_TX_RX_SEQUENCE_Callback could be implemented in the user file
    */
}

__weak void HAL_MRSubG_WKUP_Callback(void)
{
  /* NOTE : This function Should not be modified, when the callback is needed,
             the HAL_MRSubG_WKUP_Callback could be implemented in the user file
    */
}

void HAL_MRSubG_IRQHandler(void)
{
  HAL_MRSubG_IRQ_Callback();
}

void HAL_MRSubG_BUSY_IRQHandler(void)
{
  HAL_MRSubG_BUSY_Callback();
}

void HAL_MRSubG_TX_RX_SEQUENCE_IRQHandler(void)
{
  HAL_MRSubG_TX_RX_SEQUENCE_Callback();
}

void HAL_MRSubG_WKUP_IRQHandler(void)
{
  HAL_MRSubG_WKUP_Callback();
}


/**
  * @}
  */

#endif /* HAL_MRSUBG_MODULE_ENABLED */

/**
  * @}
  */

/**
  * @}
  */
